wozlol/arduinoboy-RP2040-USB_MIDI_Host/Arduinoboy/Arduinoboy.ino
// RP2040 watchdog diagnostic phases - see Watchdog_Diagnostics.ino. Recorded to watchdog
// scratch registers (which survive a watchdog-triggered reset) right before each named
// section, so if the chip hangs, the next boot can report exactly which section it was
// last in, and which mode it was in when it happened.
#define WD_PHASE_BOOT           0
#define WD_PHASE_MODE_LOOP      1
#define WD_PHASE_SETMODE        2
#define WD_PHASE_SHOW_MODE      3
#define WD_PHASE_COMMIT_WAIT    4
#define WD_PHASE_EEPROM_COMMIT  5
#define WD_PHASE_PROGRAMMER     6
#define WD_PHASE_CORE1_STALLED  7

// Defined in Watchdog_Diagnostics.ino, concatenated after this file by the Arduino build.
extern boolean wdRecoveringFromStall;

//!!! do not edit these, they are the position in EEPROM memory that contain the value of each stored setting
#define MEM_CHECK 0
#define MEM_VERSION_FIRST 1
#define MEM_VERSION_SECOND 2
#define MEM_MODE 5
#define MEM_FORCE_MODE 4

#define MEM_LSDJSLAVE_MIDI_CH 6

#define MEM_LSDJMASTER_MIDI_CH 7
#define MEM_KEYBD_CH 8

#define MEM_KEYBD_COMPAT_MODE 9
#define MEM_KEYBD_CH_TO_INST 10

#define MEM_MIDIOUT_NOTE_CH 11
#define MEM_MIDIOUT_CC_CH 15
#define MEM_MIDIOUT_CC_MODE 19
#define MEM_MIDIOUT_CC_SCALING 23
#define MEM_MIDIOUT_CC_NUMBERS 27

#define MEM_MGB_CH 55
#define MEM_LIVEMAP_CH 60

#define MEM_MIDIOUT_BIT_DELAY 61
#define MEM_MIDIOUT_BYTE_DELAY 63

/***************************************************************************
* User Settings
***************************************************************************/

boolean usbMode                  = false; //to use usb for serial communication as oppose to MIDI - sets baud rate to 38400

byte defaultMemoryMap[MEM_MAX] = {
  0x7F,0x01,0x03,0x7F, // memory init check

  0x00, // change to 0x01 to activate 'force mode' which ignores EEPROM mode changes, boots fixed
  0x04, // boot mode = internal mode 4 = README "Mode 5 Full MIDI with mGB"

  15,   // LSDJ slave sync MIDI channel, unused here
  15,   // LSDJ master note position MIDI channel, unused here
  15,   // keyboard MIDI channel, unused here

  1,    // keyboard compatibility mode
  1,    // keyboard ch to instrument

  0,1,2,3, // LSDJ midiout note channels
  0,1,2,3, // LSDJ midiout CC channels

  1,1,1,1, // CC mode
  1,1,1,1, // CC scaling

  1,2,3,7,10,11,12, // pu1 CC numbers
  1,2,3,7,10,11,12, // pu2
  1,2,3,7,10,11,12, // wav
  1,2,3,7,10,11,12, // noi

  0,1,2,3,4, // mGB midi channels

  0,    // livemap channel start
  80,1, // midiout bit delay
  0,0   // midiout byte delay
};
byte memory[MEM_MAX];

/***************************************************************************
* Lets Assign our Arduino Pins .....
***************************************************************************/


/***************************************************************************
* Teensy 3.2, Teensy LC
*
* Notes on Teensy: Pins are not the same as in the schematic, the mapping is below.
* Feel free to change, all related config in is this block.
* Be sure to compile
***************************************************************************/
#if defined (__MK20DX256__) || defined (__MK20DX128__) || defined (__MKL26Z64__)
#define USE_TEENSY 1
#define USE_USB 1
#include <MIDI.h>

#if defined (__MKL26Z64__)
#define GB_SET(bit_cl,bit_out,bit_in) GPIOB_PDOR = ((bit_in<<3) | (bit_out<<1) | bit_cl)
#else
#define GB_SET(bit_cl,bit_out,bit_in) GPIOB_PDOR = (GPIOB_PDIR & 0xfffffff4) | ((bit_in<<3) | (bit_out<<1) | bit_cl)
#endif

int pinGBClock     = 16;    // Analog In 0 - clock out to gameboy
int pinGBSerialOut = 17;    // Analog In 1 - serial data to gameboy
int pinGBSerialIn  = 18;    // Analog In 2 - serial data from gameboy
int pinMidiInputPower = 0; // Not used!
int pinStatusLed = 13; // Status LED
int pinLeds[] = {23,22,21,20,4,13}; // LED Pins
int pinButtonMode = 2; //toggle button for selecting the mode

HardwareSerial *serial = &Serial1;

/***************************************************************************
* Arduino Leonardo/Yún/Micro (ATmega32U4)
***************************************************************************/
#elif defined (__AVR_ATmega32U4__)
#define USE_LEONARDO
#include <MIDIUSB.h>

#define GB_SET(bit_cl, bit_out, bit_in) PORTF = (PINF & B00011111) | ((bit_cl<<7) | ((bit_out)<<6) | ((bit_in)<<5))
// ^ The reason for not using digitalWrite is to allign clock and data pins for the GB shift reg.
// Pin distribution comes from official Arduino Leonardo documentation

int pinGBClock     = A0;    // Analog In 0 - clock out to gameboy
int pinGBSerialOut = A1;    // Analog In 1 - serial data to gameboy
int pinGBSerialIn  = A2;    // Analog In 2 - serial data from gameboy
int pinMidiInputPower = 4; // power pin for midi input opto-isolator
int pinStatusLed = 9; // Status LED
int pinLeds[] = {3, 5, 6, 7, 8, 9}; // LED Pins
//int pinStatusLed = 13; // Status LED
//int pinLeds[] = {12,11,10,9,8,13}; // LED Pins
int pinButtonMode = 10; //toggle button for selecting the mode

HardwareSerial *serial = &Serial1;



/***************************************************************************
* Arduino Due (ATmSAM3X8E)
***************************************************************************/
#elif defined (__SAM3X8E__)
#define USE_DUE

#define USE_LEONARDO
#include <MIDIUSB.h>
#include <digitalWriteFast.h>


#define GB_SET(bit_cl, bit_out, bit_in) digitalWriteFast(A0, bit_cl); digitalWriteFast(A1, bit_out); digitalWriteFast(A2, bit_in);
// ^ The reason for not using digitalWrite is to allign clock and data pins for the GB shift reg.

int pinGBClock     = A0;    // Analog In 0 - clock out to gameboy
int pinGBSerialOut = A1;    // Analog In 1 - serial data to gameboy
int pinGBSerialIn  = A2;    // Analog In 2 - serial data from gameboy
int pinMidiInputPower = 4; // power pin for midi input opto-isolator
int pinStatusLed = 13; // Status LED
int pinLeds[] = {12,11,10,9,8,13}; // LED Pins
int pinButtonMode = 3; //toggle button for selecting the mode

HardwareSerial *serial = &Serial;

/***************************************************************************
* RP2040 / Arduino-Pico
*
* Built-in USB is a USB MIDI device. A second USB port works as a USB MIDI
* host for class-compliant USB MIDI keyboards using PIO-USB.
***************************************************************************/
#elif defined (ARDUINO_ARCH_RP2040)
#define USE_RP2040 1
#define USE_USB 1
#include <Adafruit_TinyUSB.h>
#include <MIDI.h>
#include <hardware/clocks.h>
#include <hardware/watchdog.h>
#include "pio_usb_configuration.h"
#include "pio_usb.h"

#if defined(F_CPU) && (F_CPU != 120000000UL) && (F_CPU != 240000000UL)
#error "RP2040 PIO USB host requires Arduino-Pico CPU Speed set to 120 MHz or 240 MHz."
#endif

#define GB_SET(bit_cl, bit_out, bit_in) digitalWrite(pinGBClock, bit_cl); digitalWrite(pinGBSerialOut, bit_out); digitalWrite(pinGBSerialIn, bit_in)
#define USB_MIDI_MESSAGE_DEFINED 1
struct UsbMidiMessage {
  uint8_t cin;
  uint8_t status;
  uint8_t data1;
  uint8_t data2;
  uint8_t length;
};
