wozlol/arduinoboy-RP2040-USB_MIDI_Host/Arduinoboy/Arduinoboy.ino
byte keyboardTblCue= 0x29;

byte keyboardMut1 = 0x01;
byte keyboardMut2 = 0x09;
byte keyboardMut3 = 0x78;
byte keyboardMut4 = 0x07;

byte keyboardCurL = 0x6B;
byte keyboardCurR = 0x74;
byte keyboardCurU = 0x75;
byte keyboardCurD = 0x72;
byte keyboardPgUp = 0x7D;
byte keyboardPgDn = 0x7A;
byte keyboardEntr = 0x5A;

int keyboardCurrentOct = 0;
int keyboardCurrentIns = 0;
int keyboardCurrentTbl = 0;

int keyboardLastOct = 0;
int keyboardLastIns = 0;
int keyboardLastTbl = 0;

int keyboardDiff = 0;
int keyboardCount = 0;
byte keyboardStartOctave = 0x24;
byte keyboardNoteStart = 0;
byte keyboardNoteOffset = 0;
byte keyboardCommands[12];

/***************************************************************************
* LSDJ Midi Map mode vars
***************************************************************************/
int  mapCurrentRow = -1;
int  mapQueueMessage = -1;
unsigned long mapQueueTime;
// mapQueueWait is used for delaying a sync byte
// if it is called right before a note on message on sequencer start
// (Note value is also a clock tick)
uint8_t mapQueueWaitSerial = 2; //2ms
uint8_t mapQueueWaitUsb = 5; //5ms - Needs to be longer because message packet is processed all at once

/***************************************************************************
* mGB Settings
***************************************************************************/
#define GB_MIDI_DELAY 500 //Microseconds to delay the sending of a byte to gb

void setup() {
/*
  Init Memory
*/
#ifdef USE_RP2040
  usbMidiInit();
  Serial.begin(115200); // Required by Arduino-Pico when using the TinyUSB stack.
  EEPROM.begin(256);
  wdSetup(); // reports+blinks out where the previous boot hung (if any), then arms the watchdog
#endif
  initMemory(0);
/*
  Init Pins
*/
  for(int led=0;led<=5;led++) pinMode(pinLeds[led],OUTPUT);
  pinMode(pinStatusLed,OUTPUT);
  pinMode(pinButtonMode,INPUT_PULLUP);

  pinMode(pinGBClock,OUTPUT);
  pinMode(pinGBSerialIn,INPUT);
  pinMode(pinGBSerialOut,OUTPUT);

/*
  Set MIDI Serial Rate
*/

#ifdef USE_USB
  serial->begin(31250); //31250
#else
  if(usbMode == true) {
    serial->begin(38400);
  } else {
    pinMode(pinMidiInputPower,OUTPUT);
    digitalWrite(pinMidiInputPower,HIGH); // turn on the optoisolator
    #ifdef USE_LEONARDO
      Serial1.begin(31250); //31250
    #else
      Serial.begin(31250); //31250
    #endif
  }
#endif

/*
  Set Pin States
*/
  digitalWrite(pinGBClock,HIGH);    // gameboy wants a HIGH line
  digitalWrite(pinGBSerialOut,LOW);    // no data to send
/*
  Misc Startup
*/
  keyboardNoteStart = keyboardStartOctave + 12; // Set the octave where the actual notes start (the octave below is for the mutes, cursor, etc)
/*
  Assign the keyboard mode command array for the first octave
*/
  keyboardCommands[0] = keyboardMut1;
  keyboardCommands[1] = keyboardMut2;
  keyboardCommands[2] = keyboardMut3;
  keyboardCommands[3] = keyboardMut4;
  keyboardCommands[4] = keyboardCurL;
  keyboardCommands[5] = keyboardCurR;
  keyboardCommands[6] = keyboardCurU;
  keyboardCommands[7] = keyboardCurD;
  keyboardCommands[8] = keyboardEntr;
  keyboardCommands[9] = keyboardTblDn;
  keyboardCommands[10] = keyboardTblUp;
  keyboardCommands[11] = keyboardTblCue;
/*
  Load Settings from EEPROM
*/
  #ifndef USE_DUE
  if(!memory[MEM_FORCE_MODE]) memory[MEM_MODE] = EEPROM.read(MEM_MODE);
  #endif
  lastMode = memory[MEM_MODE];

/*
  usbMidi sysex support
*/
  usbMidiInit();

#ifdef USE_RP2040
  // Skip the ~1.5s cosmetic power-on light show (and the mode-blink after it) when this
  // boot was the watchdog auto-recovering from a core1 stall - wdReportAndBlink() already
  // gave a quick visual acknowledgment, and the priority here is getting the USB host
  // port back up fast, not replaying an animation nobody asked to see again.
  if(!wdRecoveringFromStall) {
    startupSequence();
    showSelectedMode(); //Light up the LED that shows which mode we are in.
  }
#else
  startupSequence();
  showSelectedMode(); //Light up the LED that shows which mode we are in.
#endif

  usbMidiStartHost();
}

/*
  Main Loop, which we don't use to be able to isolate each mode into its own setup and loop functions
*/
void loop () {
  setMode();
  switchMode();
}
